app/Controllers/Login.php

    public function process()
    {
        $users = new UsersModel();
        $username = $this->request->getPost("username");
        $password = $this->request->getPost("password");
        $dataUser = $users->where([
            "username"=> $username
        ])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'nurkahfi'
 LIMIT 1