app/Controllers/Pages.php

    public function dashboard()
    {
        if (session()->has('username'))
        {
            $data['player'] = $this->player->find(session('user_id'));
---
SELECT *
FROM `player`
WHERE `player`.`player_id` = 'RUM1R'

    public function homepage()
    {
        $data['games'] = $this->games->findAll();

        if (session()->has('username'))
        {
            $data['player'] = $this->player->find(session('user_id'));
---
SELECT *
FROM `player`
WHERE `player`.`player_id` = '4N3L4'

    public function about()
    {
        if (session()->has('username'))
        {
            $data['player'] = $this->player->find(session('user_id'));
---
SELECT *
FROM `player`
WHERE `player`.`player_id` = '4N3L4'

    public function games($id)
    {
        $data['games'] = $this->games->find($id);
        $data['pic'] = $this->pic->find($id);

        if (session()->has('username'))
        {
            $lib = new LibraryModel();
            $cart = new CartModel();
            $data['cart'] = [];
            $dataCart = $cart->where([
                'player_id' => session('user_id'),
                'game_id' => $id
            ])->first();
            $data['lib'] = [];
            $dataLibrary = $lib->where([
                'player_id' => session('user_id'),
                'game_id' => $id
            ])->first();
            $data['lib'] = $dataLibrary;
            $data['cart'] = $dataCart;

            $data['player'] = $this->player->find(session('user_id'));
---
SELECT *
FROM `games`
WHERE `games`.`game_id` = 'BHUIS'
SELECT *
FROM `player`
WHERE `player`.`player_id` = '4N3L4'

    public function profile()
    {
        if (session()->has('username'))
        {
            $data['player'] = $this->player->find(session('user_id'));
---
SELECT *
FROM `player`
WHERE `player`.`player_id` = '4N3L4'

    public function library()
    {
        if (session()->has('username'))
        {
            $lib = new LibraryModel();
            $lib->select('library.*, games.game_pic, games.game_name');
            $lib->join('games', 'games.game_id = library.game_id');
            $lib->where([
                'player_id' => session('user_id')
            ]);
            $data['games'] = $lib->get()->getResultArray();
            $data['player'] = $this->player->find(session('user_id'));
---
SELECT *
FROM `player`
WHERE `player`.`player_id` = 'RUM1R'

    public function cart()
    {
        if (session()->has('username'))
        {
            $cart = new CartModel();

            $cart->select('cart.*, games.game_pic, games.game_name, games.price');
            $cart->join('games', 'games.game_id = cart.game_id');
            $cart->where([
                'player_id' => session('user_id')
            ]);
            $data['cart'] = $cart->get()->getResultArray();

            $data['player'] = $this->player->find(session('user_id'));
---
SELECT *
FROM `player`
WHERE `player`.`player_id` = '4N3L4'