app/Controllers/Register.php

DELETE FROM `player`
WHERE `player_id` IN ('D8U1B3')
DELETE FROM `users`
WHERE `username` IN ('umaraziz')
---
    public function delete()
    {
        $player = new PlayerModel();
        $users = new UsersModel();

        $player->delete(session('user_id'));
        $users->delete(session('username'));