app/Controllers/Users.php

SELECT *
FROM `player`
WHERE `player`.`player_id` = '4N3L4'
---
    public function edit_profile()
    {
        if (session()->has('username'))
        {
            $player = new PlayerModel();
            $data['player'] = $player->find(session('user_id'));